Repository: ricvecchio/rdv-performance-ios
Catalog: rdvperfomance/Localizable.xcstrings
Source language: pt_br
Languages: en, es

# ui.no_valid_workout_was_found_in_the_spreadsheet
source: Não foi encontrado nenhum treino válido na planilha.
en: No valid workout was found in the spreadsheet.
es: No se encontró ningún entrenamiento válido en la hoja de cálculo.

# ui.no_video_registered
source: Nenhum vídeo cadastrado
en: No video registered
es: No hay videos registrados

# ui.no_week_registered_for_this_student
source: Nenhuma semana cadastrada para este aluno.
en: No week registered for this student.
es: No hay semanas registradas para este alumno.

# ui.no_wod_registered
source: Nenhum WOD cadastrado
en: No WOD registered
es: No hay WOD registrados

# ui.no_workout
source: Sem treino
en: No workout
es: Sin entrenamiento

# ui.no_workout_found
source: Nenhum treino encontrado
en: No workout found
es: No se encontró ningún entrenamiento

# ui.no_workout_registered
source: Nenhum treino cadastrado
en: No workout registered
es: No hay entrenamientos registrados

# ui.no_workout_registered_2
source: Nenhum treino cadastrado.
en: No workout registered.
es: No hay entrenamientos registrados.

# ui.only_coaches_can_access_feedback
source: Apenas professor pode acessar feedbacks.
en: Only coaches can access feedback.
es: Solo los entrenadores pueden acceder a los comentarios.

# ui.only_coaches_can_add_days
source: Apenas professor pode adicionar dias.
en: Only coaches can add days.
es: Solo los entrenadores pueden agregar días.

# ui.only_coaches_can_add_wods
source: Apenas professor pode adicionar WODs.
en: Only coaches can add WODs.
es: Solo los entrenadores pueden agregar WODs.

# ui.only_coaches_can_add_workouts
source: Apenas professor pode adicionar treinos.
en: Only coaches can add workouts.
es: Solo los entrenadores pueden agregar entrenamientos.

# ui.only_coaches_can_save_feedback
source: Apenas professor pode salvar feedback.
en: Only coaches can save feedback.
es: Solo los entrenadores pueden guardar comentarios.

# ui.only_trainers_can_access_messages
source: Apenas professor pode acessar mensagens.
en: Only trainers can access messages.
es: Solo los entrenadores pueden acceder a los mensajes.

# ui.only_trainers_can_send_messages
source: Apenas professor pode enviar mensagens.
en: Only trainers can send messages.
es: Solo los entrenadores pueden enviar mensajes.

# ui.open_settings
source: Abrir Ajustes
en: Open Settings

# ui.open_youtube
source: Abrir YouTube
en: Open YouTube

# ui.organize_your_movement_videos
source: Organize seus vídeos de movimentos
en: Organize your movement videos
es: Organiza tus videos de movimientos

# ui.organize_your_videos
source: Organize seus vídeos
en: Organize your videos
es: Organiza tus videos

# ui.paste_the_youtube_link_and_add_a_title_to_make_it_easier_to_find
source: Cole o link do YouTube e adicione um título para facilitar a busca.
en: Paste the YouTube link and add a title to make it easier to find.
es: Pega el enlace de YouTube y agrega un título para facilitar la búsqueda.

# ui.pending
source: Pendente
en: Pending
es: Pendiente

# ui.pending_request_for_student_exists
source: Já existe uma solicitação pendente para esse aluno.
en: There is already a pending request for this student.
es: Ya existe una solicitud pendiente para este alumno.

# ui.play_with_airplay
source: Reproduzir com AirPlay
en: Play with AirPlay
es: Reproducir con AirPlay

# ui.progress
source: PROGRESSOS
en: PROGRESS
es: PROGRESO

# ui.progress_complete_percentage
source: %d%% completo
en: %d%% complete
es: %d%% completado

# ui.progress_preview
source: Preview do Progresso
en: Progress Preview
es: Vista previa del progreso

# ui.publish
source: Publicar
en: Publish

# ui.publish_week
source: Publicar semana
en: Publish week

# ui.published
source: Publicada
en: Published

# ui.quick_access
source: Acesso rápido
en: Quick access
es: Acceso rápido

# ui.record_feedback_and_track_the_history
source: Registre feedbacks e acompanhe o histórico.
en: Record feedback and track the history.
es: Registra comentarios y sigue el historial.

# ui.registered_weeks
source: SEMANAS CADASTRADAS
en: REGISTERED WEEKS
es: SEMANAS REGISTRADAS

# ui.remove
source: Remover
en: Remove
es: Eliminar

# ui.remove_location
source: Remover localização
en: Remove location
es: Eliminar ubicación

# ui.required_column_not_found_title
source: Coluna obrigatória não encontrada: Título.
en: Required column not found: Title.
es: No se encontró la columna obligatoria: Título.

# ui.save_changes
source: Salvar Alterações
en: Save Changes
es: Guardar cambios

# ui.save_day
source: Salvar Dia
en: Save Day
es: Guardar día

# ui.save_last_location
source: Salvar última localização
en: Save last location
es: Guardar última ubicación

# ui.save_wod
source: Salvar WOD
en: Save WOD
es: Guardar WOD

# ui.save_workout
source: Salvar Treino
en: Save Workout
es: Guardar entrenamiento

# ui.save_youtube_links_to_view_later
source: Salve links do YouTube para consultar depois.
en: Save YouTube links to view later.
es: Guarda enlaces de YouTube para consultarlos después.

# ui.search_student
source: Buscar aluno...
en: Search student...
es: Buscar alumno...

# ui.section
source: SEÇÃO
en: SECTION
es: SECCIÓN

# ui.section_value
source: Seção: %@
en: Section: %@
es: Sección: %@

# ui.select
source: Selecionar
en: Select
es: Seleccionar

# ui.select_3_shortcuts
source: Selecione 3 atalhos.
en: Select 3 shortcuts.
es: Selecciona 3 accesos directos.

# ui.select_a_section
source: Selecione uma seção.
en: Select a section.
es: Selecciona una sección.

# ui.select_a_section_first
source: Selecione uma seção primeiro
en: Select a section first
es: Selecciona primero una sección

# ui.select_a_student_first
source: Selecione um aluno primeiro
en: Select a student first
es: Selecciona primero un alumno

# ui.select_a_student_to_view_details_and_create_workouts
source: Selecione um aluno para ver detalhes e criar treinos.
en: Select a student to view details and create workouts.
es: Selecciona un alumno para ver detalles y crear entrenamientos.

# ui.select_a_valid_week
source: Selecione uma semana válida.
en: Select a valid week.
es: Selecciona una semana válida.

# ui.select_all
source: Selecionar todos
en: Select all
es: Seleccionar todo

# ui.select_destination_for_value
source: Selecione o destino para: %@
en: Select the destination for: %@
es: Selecciona el destino para: %@

# ui.select_exactly_3_shortcuts
source: Selecione exatamente 3 atalhos.
en: Select exactly 3 shortcuts.
es: Selecciona exactamente 3 accesos directos.

# ui.select_link_category
source: Selecione a categoria do vínculo
en: Select link category
es: Selecciona la categoría del vínculo

# ui.select_section
source: Selecionar seção
en: Select section
es: Seleccionar sección

# ui.select_student
source: Selecionar aluno
en: Select student
es: Seleccionar alumno

# ui.select_students
source: Selecionar alunos
en: Select students
es: Seleccionar alumnos

# ui.select_the_workout_destination
source: Selecione o destino do treino.
en: Select the workout destination.
es: Selecciona el destino del entrenamiento.

# ui.select_week
source: Selecionar semana
en: Select week
es: Seleccionar semana

# ui.select_workout
source: SELECIONAR TREINO
en: SELECT WORKOUT
es: SELECCIONAR ENTRENAMIENTO

# ui.select_workout_2
source: Selecionar treino
en: Select workout
es: Seleccionar entrenamiento

# ui.select_workout_value
source: Selecionar treino - %1$@
en: Select workout - %1$@
es: Seleccionar entrenamiento - %1$@

# ui.selected_students
source: ALUNOS SELECIONADOS
en: SELECTED STUDENTS
es: ALUMNOS SELECCIONADOS

# ui.selected_video
source: Vídeo selecionado
en: Selected video
es: Video seleccionado

# ui.send
source: Enviar
en: Send

# ui.send_a_workout_to_your_students
source: Envie um treino para seus alunos
en: Send a workout to your students
es: Envía un entrenamiento a tus alumnos

# ui.send_guidance_notices_and_messages_to_the_student
source: Envie orientações, avisos e recados para o aluno.
en: Send guidance, notices, and messages to the student.
es: Envía orientaciones, avisos y mensajes al alumno.

# ui.send_invitation
source: Enviar convite
en: Send invitation
es: Enviar invitación

# ui.send_to_student
source: Enviar para aluno
en: Send to student
es: Enviar al alumno

# ui.send_to_workouts
source: Enviar para Treinos
en: Send to Workouts
es: Enviar a Entrenamientos

# ui.send_video
source: Enviar vídeo
en: Send video
es: Enviar video

# ui.send_workout
source: Enviar treino
en: Send workout
es: Enviar entrenamiento

# ui.sending_workout_please_wait
source: Enviando treino... aguarde.
en: Sending workout... please wait.
es: Enviando entrenamiento... espera.

# ui.shoulders
source: Ombros
en: Shoulders
es: Hombros

# ui.student_already_linked
source: Esse aluno já esta vinculado.
en: This student is already linked.
es: Este alumno ya está vinculado.

# ui.student_email
source: E-mail do aluno
en: Student email
es: Correo electrónico del alumno

# ui.student_linked
source: Aluno vinculado.
en: Student linked.
es: Alumno vinculado.

# ui.student_linked_successfully
source: Aluno vinculado com sucesso.
en: Student linked successfully.
es: Alumno vinculado correctamente.

# ui.student_progress
source: Progresso do Aluno
en: Student Progress
es: Progreso del alumno

# ui.student_value
source: Aluno: %1$@
en: Student: %1$@
es: Alumno: %1$@

# ui.student_will_be_unlinked_from_category
source: O aluno "%@" será desvinculado da categoria %@.
en: Student "%@" will be unlinked from the %@ category.
es: El alumno "%@" se desvinculará de la categoría %@.

# ui.success
source: Sucesso
en: Success
es: Éxito

# ui.tap_add_video_to_save_youtube_link
source: Toque em "Adicionar Vídeo" para salvar um link do YouTube.
en: Tap "Add Video" to save a YouTube link.
es: Toca "Agregar video" para guardar un enlace de YouTube.

# ui.tap_add_wod_to_start
source: Toque em "Adicionar WOD" para começar.
en: Tap "Add WOD" to get started.
es: Toca "Agregar WOD" para comenzar.

# ui.tap_import_excel_to_add_workouts
source: Toque em "Importar Excel" para cadastrar treinos via planilha.
en: Tap "Import Excel" to add workouts from a spreadsheet.
es: Toca "Importar Excel" para agregar entrenamientos desde una hoja de cálculo.

# ui.tap_to_create_your_first_workout
source: Toque em + para criar seu primeiro treino.
en: Tap + to create your first workout.
es: Toca + para crear tu primer entrenamiento.

# ui.the_invitation_will_be_canceled
source: O convite será cancelado.
en: The invitation will be canceled.
es: La invitación se cancelará.

# ui.the_student_must_have_a_registered_week
source: O aluno deve ter uma semana cadastrada.
en: The student must have a registered week.
es: El alumno debe tener una semana registrada.

# ui.the_student_will_only_appear_in_your_list_after_accepting_the_app_invitation
source: O aluno só aparecerá na sua lista após aceitar o convite no app.
en: The student will only appear in your list after accepting the app invitation.
es: El alumno solo aparecerá en tu lista después de aceptar la invitación en la app.

# ui.this_wod_does_not_yet_have_warm_up_technique_wod_blocks
source: Este WOD ainda não possui Aquecimento/Técnica/WOD/Blocos.
en: This WOD does not yet have Warm-up/Technique/WOD/Blocks.
es: Este WOD aún no tiene Calentamiento/Técnica/WOD/Bloques.

# ui.this_workout_will_be_available_in_my_workouts_to_attach_to_days_weeks
source: Este treino ficará disponível em “Meus Treinos” para anexar nos dias/semanas.
en: This workout will be available in “My Workouts” to attach to days/weeks.
es: Este entrenamiento estará disponible en “Mis entrenamientos” para adjuntarlo a días/semanas.

# ui.title
source: Título
en: Title

# ui.title_optional
source: Título (opcional)
en: Title (optional)

# ui.title_updated_successfully
source: Título atualizado com sucesso.
en: Title updated successfully.
es: Título actualizado correctamente.

# ui.today_s_summary
source: Resumo de hoje
en: Today's summary
es: Resumen de hoy

# ui.track_and_record_your_results
source: Acompanhe e registre seus resultados
en: Track and record your results
es: Sigue y registra tus resultados

# ui.tracking_your_class_s_progress
source: Acompanhando a evolução da sua turma.
en: Tracking your class's progress.
es: Siguiendo el progreso de tu grupo.

# ui.try_again
source: Tentar novamente
en: Try again
es: Intentar de nuevo

# ui.unable_to_edit_invalid_week
source: Não foi possível editar: semana inválida.
en: Unable to edit: invalid week.
es: No fue posible editar: semana no válida.

# ui.unable_to_find_a_data_tab_in_the_spreadsheet
source: Não foi possível localizar uma aba de dados na planilha.
en: Unable to find a data tab in the spreadsheet.
es: No fue posible encontrar una pestaña de datos en la hoja de cálculo.

# ui.unable_to_find_the_spreadsheet_template_in_the_app
source: Não foi possível localizar o modelo da planilha no aplicativo.
en: Unable to find the spreadsheet template in the app.
es: No se pudo encontrar la plantilla de hoja de cálculo en la aplicación.

# ui.unable_to_identify_link_request
source: Não foi possível identificar a solicitação de vínculo.
en: Unable to identify the link request.
es: No se pudo identificar la solicitud de vínculo.

# ui.unable_to_identify_student_link
source: Não foi possível identificar o vínculo do aluno.
en: Unable to identify the student link.
es: No se pudo identificar el vínculo del alumno.

# ui.unable_to_identify_teacher_email
source: Não foi possível identificar o e-mail do professor.
en: Unable to identify the teacher email.
es: No se pudo identificar el correo electrónico del profesor.

# ui.unable_to_identify_the_signed_in_trainer
source: Não foi possível identificar o professor logado.
en: Unable to identify the signed-in trainer.
es: No se pudo identificar al entrenador que inició sesión.

# ui.unable_to_identify_the_student_to_change_the_category
source: Não foi possível identificar o aluno para alterar a categoria.
en: Unable to identify the student to change the category.
es: No fue posible identificar al alumno para cambiar la categoría.

# ui.unable_to_prepare_the_spreadsheet_for_download_value
source: Não foi possível preparar a planilha para download: %@
en: Unable to prepare the spreadsheet for download: %@
es: No se pudo preparar la hoja de cálculo para descargar: %@

# ui.unable_to_read_the_selected_excel_file
source: Não foi possível ler o arquivo Excel selecionado.
en: Unable to read the selected Excel file.
es: No fue posible leer el archivo de Excel seleccionado.

# ui.unable_to_remove_invalid_workout_id
source: Não foi possível remover: id do treino inválido.
en: Unable to remove: invalid workout ID.
es: No se pudo eliminar: ID de entrenamiento no válido.

# ui.unable_to_save_invalid_templateid
source: Não foi possível salvar: templateId inválido.
en: Unable to save: invalid templateId.
es: No fue posible guardar: templateId no válido.

# ui.unable_to_save_invalid_workout_id
source: Não foi possível salvar: id do treino inválido.
en: Unable to save: invalid workout ID.
es: No fue posible guardar: ID de entrenamiento no válido.

# ui.unable_to_send_invalid_workout
source: Não foi possível enviar: treino inválido.
en: Unable to send: invalid workout.
es: No se pudo enviar: entrenamiento no válido.

# ui.unable_to_validate_your_authentication_to_access_your_videos
source: Não foi possível validar sua autenticação para acessar seus vídeos.
en: Unable to validate your authentication to access your videos.
es: No fue posible validar tu autenticación para acceder a tus videos.

# ui.unlink
source: Desvincular
en: Unlink

# ui.unlink_student
source: Desvincular aluno?
en: Unlink student?
es: ¿Desvincular alumno?

# ui.unnamed
source: Sem nome
en: Unnamed
es: Sin nombre

# ui.upcoming_weeks
source: Próximas semanas
en: Upcoming weeks

# ui.use_ready_made_templates
source: Use modelos prontos
en: Use ready-made templates
es: Usa plantillas prediseñadas

# ui.video_category
source: Categoria do vídeo
en: Video category
es: Categoría de video

# ui.video_sent_successfully
source: Vídeo enviado com sucesso!
en: Video sent successfully!
es: ¡Video enviado correctamente!

# ui.view_days
source: Ver dias
en: View days
es: Ver días

# ui.week
source: Semana
en: Week

# ui.week_deleted_successfully
source: Semana excluída com sucesso.
en: Week deleted successfully.
es: Semana eliminada correctamente.

# ui.week_published_successfully
source: Semana publicada com sucesso.
en: Week published successfully.
es: Semana publicada correctamente.

# ui.week_title
source: Título da semana
en: Week title
es: Título de la semana

# ui.week_will_be_deleted
source: A semana "%@" será excluída (dias e progresso também).
en: Week "%@" will be deleted (including days and progress).
es: La semana "%@" será eliminada (incluidos los días y el progreso).

# ui.wod_title
source: Título do WOD
en: WOD title
es: Título del WOD

# ui.workout
source: Treino
en: Workout
es: Entrenamiento

# ui.workout_category
source: Categoria do Treino
en: Workout Category
es: Categoría de entrenamiento

# ui.workout_library
source: Biblioteca de Treinos
en: Workout Library
es: Biblioteca de entrenamientos

# ui.workout_sent_successfully
source: Treino enviado com sucesso!
en: Workout sent successfully!
es: ¡Entrenamiento enviado correctamente!

# ui.workout_sent_successfully_2
source: Treino enviado com sucesso
en: Workout sent successfully
es: Entrenamiento enviado correctamente

# ui.workout_sent_successfully_to_value
source: Treino enviado com sucesso para %@!
en: Workout sent successfully to %@!
es: ¡Entrenamiento enviado correctamente a %@!

# ui.workout_title
source: Título do treino
en: Workout title
es: Título del entrenamiento

# ui.workout_title_2
source: Título do Treino
en: Workout title
es: Título del entrenamiento

# ui.workouts
source: Treinos
en: Workouts
es: Entrenamientos

# ui.workouts_today
source: Treinos hoje
en: Workouts today
es: Entrenamientos hoy

# ui.you_can_view_registered_weeks_edit_the_title_and_add_days
source: Você pode ver semanas já cadastradas, editar o título e adicionar dias.
en: You can view registered weeks, edit the title, and add days.
es: Puedes ver semanas registradas, editar el título y agregar días.

# ui.youtube_link
source: Link do YouTube
en: YouTube Link
es: Enlace de YouTube

source: Última: %.5f, %.5f
en: Last: %.5f, %.5f

# update.required.action
source: ATUALIZAR AGORA
en: UPDATE NOW
es: ACTUALIZAR AHORA

# update.required.message
source: Uma nova versão do RDV Performance está disponível. Atualize o aplicativo para continuar.
en: A new version of RDV Performance is available. Update the app to continue.
es: Hay una nueva versión de RDV Performance disponible. Actualiza la aplicación para continuar.

# update.required.title
source: Atualização necessária
en: Update required
es: Actualización requerida

source: Use modelos prontos
en: Use ready-made templates
es: Usa plantillas prediseñadas

source: Usuário criado no Auth, mas falhou ao salvar no Firestore. Motivo: %@ Verifique as regras do Firestore.
en: User created in Auth, but saving to Firestore failed. Reason: %@ Check the Firestore rules.
es: Usuario creado en Auth, pero no se pudo guardar en Firestore. Motivo: %@ Verifica las reglas de Firestore.

source: Ver dias
en: View days
es: Ver días

source: Ver todos
en: View all
es: Ver todo

source: Vídeo do YouTube
en: YouTube Video
es: Video de YouTube

source: Vídeo enviado com sucesso!
en: Video sent successfully!
es: ¡Video enviado correctamente!

source: Vídeo salvo em Meus Vídeos.
en: Video saved to My Videos.
es: Video guardado en Mis videos.

source: Vídeo selecionado
en: Selected video
es: Video seleccionado

# video.category.gym
source: Academia
en: Gym
es: Gimnasio

# video.category.home
source: Em Casa
en: At Home
es: En Casa

# video.link.pasted
source: Link do YouTube colado da área de transferência.
en: YouTube link pasted from the clipboard.
es: Enlace de YouTube pegado desde el portapapeles.

# video.youtube.opened
source: YouTube aberto. Copie o link do vídeo e volte para colar aqui.
en: YouTube opened. Copy the video link and return here to paste it.
es: YouTube se abrió. Copia el enlace del video y vuelve aquí para pegarlo.

source: Vídeos
en: Videos
es: Videos

source: Vincule alunos ao seu perfil para aparecerem aqui.
en: Link students to your profile for them to appear here.
es: Vincula alumnos a tu perfil para que aparezcan aquí.

source: Vincule-se a um professor para receber treinos e acompanhar sua evolução.
en: Link with a coach to receive workouts and track your progress.
es: Vincúlate con un entrenador para recibir entrenamientos y seguir tu evolución.

source: Você ainda não tem um professor vinculado
en: You do not have a linked coach yet
es: Aún no tienes un entrenador vinculado

source: Você está marcado como desistente nessa aula, entre em contato com a recepção caso deseje alterar.
en: You are marked as withdrawn from this class. Contact the front desk if you want to change this.
es: Estás marcado como retirado de esta clase. Ponte en contacto con recepción si deseas cambiarlo.

source: Você não possui treinos pendentes a partir de hoje.
en: You have no pending workouts starting today.
es: No tienes entrenamientos pendientes a partir de hoy.

source: Você não possui treinos programados para as próximas semanas.
en: You have no workouts scheduled for the coming weeks.
es: No tienes entrenamientos programados para las próximas semanas.

source: Você não possui treinos programados para esta semana.
en: You do not have workouts scheduled for this week.
es: No tienes entrenamientos programados para esta semana.

source: Você pode ver semanas já cadastradas, editar o título e adicionar dias.
en: You can view registered weeks, edit the title, and add days.
es: Puedes ver semanas registradas, editar el título y agregar días.

source: Você possui %lld convites pendentes
en: You have %lld pending invitations
es: Tienes %lld invitaciones pendientes

source: Você possui um convite pendente
en: You have one pending invitation
es: Tienes una invitación pendiente

source: Você precisará entrar novamente para consultar o WOD do dia.
en: You will need to sign in again to view today's WOD.
es: Tendrás que iniciar sesión de nuevo para consultar el WOD del día.

source: Voltar
en: Back
es: Volver

source: Voltar à agenda
en: Back to schedule
es: Volver a la agenda

source: weekId inválido.
en: Invalid weekId.
es: weekId no válido.

source: WhatsApp (opcional)
en: WhatsApp (optional)

source: WOD do dia
en: WOD of the day
es: WOD del día

source: WOD do dia (%@)
en: WOD of the day (%@)
es: WOD del día (%@)

# workout_block.loads_and_movements
source: Cargas / Movimentos
en: Loads / Movements
es: Cargas / Movimientos

# workout_block.technique
source: Técnica
en: Technique

# workout_block.warmup
source: Aquecimento
en: Warm-up
es: Calentamiento

# workout_block.workout
source: Treino
en: Workout
es: Entrenamiento

# workout_day_detail.blocks
source: Blocos
en: Blocks
es: Bloques

# workout_day_detail.calculation_by_pr_barbell
source: Cálculo por % do PR (Barbell)
en: Calculation by PR % (Barbell)
es: Cálculo por % del PR (Barbell)

# workout_day_detail.data_is_saved_automatically_for_this_day
source: Os dados ficam salvos automaticamente para este dia.
en: Data is saved automatically for this day.
es: Los datos se guardan automáticamente para este día.

# workout_day_detail.day_delete_confirmation
source: O dia "%@" será excluído.
en: The day "%@" will be deleted.
es: El día "%@" será eliminado.

# workout_day_detail.delete_day
source: Excluir dia?
en: Delete day?
es: ¿Eliminar día?

# workout_day_detail.description_field
source: Descrição
en: Description
es: Descripción

# workout_day_detail.e_g_50
source: Ex: 50
en: E.g.: 50
es: Ej.: 50

# workout_day_detail.edit
source: Editar
en: Edit
